{
  "18+": [
    "keep the card and have the right to add one drink from someone else in any turn",
    "the card holder is blindfolded, touches hands, and guesses the person, wrong guess drinks",
    "The card holder decides who drinks that glass with them (50/50)",
    "Play word chain starting from the card holder, loser drinks",
    "The two people next to the card holder drink",
    "keep the card and have the right to designate one person to drink in your place once",
    "anyone who plays Blackjack badly drinks",
    "anyone who has been cheated on drinks",
    "anyone who just got a new girlfriend/boyfriend drinks",
    "everyone guesses the underwear color of the opposite gender, wrong guess drinks",
    "the card holder chooses anyone and asks about: \"my preferences, ex, personality...\" if they don't know, the chosen person drinks, if they know, you drink",
    "compete telling Vietnamese proverbs, anyone stuck drinks",
    "anyone who is often late to work drinks",
    "anyone who has been called to the principal's office drinks",
    "anyone who hasn't drunk anything yet drinks",
    "Whoever has the longest relationship drinks",
    "the youngest person drinks with the oldest person",
    "the person who swears the most drinks",
    "anyone who left the game for love drinks",
    "anyone who has been called to meet parents drinks",
    "the person with shortest hair drinks with the person with longest hair",
    "anyone who often makes people confused drinks",
    "Have you ever gone commando in public? (no answer drinks)",
    "share the link of thathaythach.xyz on your profile, with caption saying this is the best truth or dare game (don't do it drinks)",
    "Talk about your three sexiest features (don't talk drinks)",
    "Anyone who doesn't know what Peter is drinks (if you know, explain what it is)",
    "Sing and dance to a song chosen by someone else",
    "nose touches nose with the person opposite for 10 seconds or drink",
    "let the person on the left choose someone of the opposite gender from your friend list, you must like 15 photos of that person or drink",
    "call someone of the opposite gender from your contacts and say you're drunk or drink",
    "Name 5 cosmetic brands for girls (if you're a boy)/ 5 cosmetic brands for boys (if you're a girl)",
    "keep the card and have the right to choose someone else to do the challenge in your place once",
    "Post an ex's photo on Facebook or drink",
    "Anyone who doesn't know J97 drinks",
    "send a voice message to your ex saying sorry, I was terrible (don't do it drinks)",
    "read aloud clearly Ho Chi Minh's Five Teachings, read wrong or don't read drinks",
    "kiss the cheek of the person on the left or drink",
    "Anyone wearing the same outer shirt color drinks, if not you drink alone",
    "swap shirts with the person on the right and wear it for three consecutive turns",
    "go to the bathroom and bring out one item and take a photo",
    "Text mom/wife/husband/girlfriend/boyfriend that you're not coming home tonight",
    "show all items in your bag/wallet/purse you're carrying or drink",
    "Send shoes or socks of anyone designated or drink",
    "Stare at any stranger until they look back and smile really big or drink",
    "answer the question who is the President of Vietnam, wrong answer drinks",
    "remove makeup for girls, put on lipstick for boys, if you can't do it drinks",
    "tell five 18+ positions you like",
    "no one can say any sentence with the 3 words \"drink\", \"beer\", \"wine\" for 9 minutes, anyone who violates drinks",
    "ask for info from a stranger on Facebook or drink",
    "call and confess to your Crush or drink",
    "tell the reason for your most recent breakup or quitting job",
    "tell about three weird hobbies of yours or drink",
    "everyone at the table plays passing paper with mouth in a circle, anyone who drops or tears the paper drinks",
    "what shady thing have you done between you and someone of the opposite gender",
    "the card holder can skip one turn or one drink",
    "change Facebook Avatar to a picture and caption dumb as a pig",
    "show phone web history or drink",
    "stand up and say loudly and clearly \"Today I'm drunk\" or drink",
    "hug the person on the right for 1 minute or drink",
    "everyone at the table bows head and counts 3 2 1 everyone will look up and look at 1 person, if 2 people look at each other they drink",
    "The card holder acts out a song lyric with body language, everyone guesses, wrong guess drinks",
    "kiss anyone of the opposite gender at the table or drink",
    "the card holder counts to 123 everyone must freeze immediately, anyone who moves first drinks",
    "answer the question what is Ho Chi Minh's birthday. Wrong answer or can't answer drinks",
    "sing a song with a voice opposite to your gender or drink",
    "play Arm Wrestling with the person opposite, loser drinks",
    "Call your best friend and say you like their girlfriend/boyfriend",
    "call your ex and ask to get back together or drink",
    "Name 5 national heroes or drink",
    "kiss anyone of the same gender or drink",
    "call your parents and say you owe 1 million or drink",
    "answer the question do you want to get back together with your ex",
    "the card holder can decide to cancel one drink of anyone except themselves",
    "text Parents/Boss that you want to drop out of school/quit your job, then block them until the drinking session ends",
    "look into the eyes of the person opposite, whoever blinks first drinks",
    "Name 5 condom brands or drink",
    "run around the room imitating a monkey or drink",
    "call your dad or mom and say your girlfriend is pregnant (for guys) Or I'm pregnant (for girls)",
    "tell about a secret of yours that no one knows or drink",
    "everyone drinks except the card holder",
    "call your ex and ask how are you or drink",
    "send 15 friend requests to anyone of the opposite gender on Facebook or drink",
    "Reenact the cat expression \"meow meow meow\" of Tran Duc Bo or drink",
    "Show the 3 most recent photos in your phone or drink",
    "Name 5 sex toys",
    "tell about 1 embarrassing memory of yours",
    "tell what you think when sitting in the bathroom or drink",
    "keep the card and have the right to choose to sip once",
    "call and invite your ex to your wedding or drink",
    "show your bank account balance or drink",
    "what would you do if you had invisibility superpower or drink",
    "tell three best things about your ex or drink",
    "anyone who has had a one-sided crush without daring to confess drinks",
    "The richest kid here drinks",
    "the person opposite kisses the cheek of someone designated by everyone",
    "Anyone who doesn't leave their phone for one second drinks",
    "Anyone who often cancels plans at the last minute drinks",
    "anyone who has skipped school and got caught drinks",
    "No girlfriend/boyfriend drinks 2 glasses, have girlfriend/boyfriend drinks 1 glass",
    "Sing word chain starting from the card holder, loser drinks",
    "anyone who has fed dessert to a dog drinks",
    "everyone at the table drinks 1 glass without using hands, anyone who can't do it drinks 1 more glass",
    "The card holder talks with 2 lips not touching for 3 minutes, lose drinks",
    "The player who is always late drinks",
    "anyone who has used Tinder drinks",
    "anyone unlucky in both gambling and love drinks"
  ],
  "18+_tao_bao": [
    "take off your shirt and put it back on, while taking it off you must tell about your first time having sex or drink 3 glasses",
    "tell in detail about your first time having sex or drink 2 glasses",
    "video call your ex and say \"I miss you\" then hang up immediately or drink 3 glasses",
    "post a story on Instagram/Facebook telling about your \"hottest\" memory or drink 2 glasses",
    "act out a sex position you like with actions, everyone guesses or drink 2 glasses",
    "tell about having sex in a public place or the most unusual place or drink 3 glasses",
    "text your crush \"I want to have sex with you\" and screenshot and send to the group or drink 4 glasses",
    "read aloud an adult story that someone else chooses or drink 2 glasses",
    "tell about your longest time having sex (how long) or drink 2 glasses",
    "describe in detail the most sensitive spot on your body or drink 2 glasses",
    "call your ex and ask \"do you remember the last time we had sex?\" then hang up or drink 3 glasses",
    "tell about your most intense/craziest time having sex or drink 2 glasses",
    "mime a sex position with the person opposite using gestures (don't touch) or drink 3 glasses",
    "tell about the number of people you've had sex with or drink 2 glasses",
    "post a story on social media \"Tonight I want to have sex\" or drink 3 glasses",
    "text anyone in your contacts \"I want to touch you\" or drink 4 glasses",
    "tell about having sex with multiple people at the same time or drink 3 glasses",
    "describe in detail your ideal foreplay or drink 2 glasses",
    "call your parents and say \"I'm having sex\" then hang up immediately or drink 5 glasses",
    "tell about having sex with a stranger or one night stand or drink 3 glasses",
    "post a selfie in only underwear on story with caption \"Tonight I'm ready\" or drink 4 glasses",
    "describe in detail the size of your \"private parts\" or \"chest/butt\" or drink 2 glasses",
    "tell about the time you had the best orgasm or drink 2 glasses",
    "text your crush \"I'm imagining having sex with you\" and screenshot and send to the group or drink 4 glasses",
    "read aloud an adult sentence that someone else writes or drink 2 glasses",
    "tell about the time you were caught or almost caught having sex or drink 2 glasses",
    "describe in detail your most memorable sexual dream or drink 2 glasses",
    "video call your ex and make a seductive gesture for 5 seconds then hang up or drink 4 glasses",
    "tell about having sex with a sex toy or drink 2 glasses",
    "post status on Facebook \"Tonight whoever wants to have sex with me inbox\" or drink 5 glasses",
    "tell in detail about the most public place you had sex or drink 3 glasses",
    "act out with body language a sex position you want to try most or drink 2 glasses",
    "call your crush and say \"I'm thinking about you\" then hang up immediately or drink 3 glasses",
    "post a story telling about your \"hottest\" time having sex with emoji 🔥 or drink 2 glasses",
    "tell about the time you had sex that you can't forget (details) or drink 2 glasses",
    "describe in detail your G-spot or most sensitive spot or drink 2 glasses",
    "text your ex \"do you remember the last time we had sex?\" or drink 3 glasses",
    "tell about the time you reached the peak most (detailed feeling) or drink 2 glasses",
    "post a selfie in only underwear on story with seductive caption or drink 4 glasses",
    "video call your crush and make a seductive gesture for 3 seconds or drink 4 glasses",
    "tell about having sex with a stranger whose name you don't know or drink 3 glasses",
    "describe in detail the foreplay that made you \"go crazy\" most or drink 2 glasses",
    "post status \"I need to be satisfied right now\" on Facebook or drink 5 glasses",
    "tell about the number of people you've had sex with (specific) or drink 2 glasses",
    "text anyone \"I want you right now\" or drink 4 glasses",
    "describe in detail the size and shape of your \"private parts\" or drink 2 glasses",
    "tell about the time you experimented with something new most or drink 2 glasses",
    "call your parents and say \"I'm having sex\" then hang up immediately or drink 5 glasses",
    "post a seductive photo on Instagram with hashtag #hot #sexy or drink 3 glasses",
    "tell about having sex with multiple people at the same time (details) or drink 3 glasses",
    "describe how you like to be touched most or drink 2 glasses",
    "text your crush \"I'm imagining having sex with you right now\" or drink 4 glasses",
    "read aloud an adult story that someone else chooses (at least 3 sentences) or drink 2 glasses",
    "tell about the time you didn't use a condom (if applicable) or drink 3 glasses",
    "describe in detail your first time having sex (step by step) or drink 2 glasses",
    "video call your ex and kiss the screen then hang up or drink 3 glasses",
    "post story \"I need someone to come to me right now\" or drink 4 glasses",
    "tell about the time you came multiple times most or drink 2 glasses",
    "describe the sex position you like most (detailed every movement) or drink 2 glasses",
    "text a stranger on social media \"I want you\" or drink 4 glasses",
    "post a photo in only underwear on story with provocative caption or drink 4 glasses",
    "tell about the time you made the loudest sounds during sex or drink 2 glasses"
  ],
  "tinh_ban": [
    "tell the most embarrassing memory you've had with this group",
    "who is the person who is always late in the group? that person says the reason or drinks",
    "tell the time you were saved from a disaster by someone at the table",
    "give a funny nickname to the person opposite, they have the right to refuse and you drink",
    "share 3 things you like about the person on the left",
    "tell the time you helped someone in the group and felt happiest",
    "who often forgets birthdays? the person called explains in 15 seconds or drinks",
    "act out the group's funny habit with actions, everyone guesses",
    "send a sincere thank you message to someone at the table (saying it out loud is fine)",
    "tell the time the whole group almost had a disaster but handled it",
    "who often cancels plans at the last minute? that person drinks or tells a funny reason",
    "tell a small secret the group doesn't know (or drink)",
    "describe the friend on the right with 3 adjectives",
    "tell the time you laughed so hard with someone in the group",
    "who is the comedian of the group? that person tells a short funny story",
    "tell your weird habit when hanging out with the group",
    "tell the time the group helped you overcome a deadline/major disaster",
    "if you had to choose the only teammate to go \"save you\", who would you choose?",
    "tell the time you and someone in the group accidentally dressed alike",
    "who often forgets things? that person tells the most \"epic\" thing they forgot",
    "tell the playlist or shared song connected with the group",
    "describe the most memorable trip with the group",
    "if the whole group started a band, what instrument would you play?",
    "tell the time the group got lost or the schedule went wrong",
    "who at the table is the most real? explain briefly",
    "tell a good habit you learned from someone in the group",
    "who is the \"softest hearted\" person? that person tells a recent time they were weak",
    "tell the time the group surprised you most",
    "tell the time you made the group \"lose face\" a bit and how you handled it",
    "choose one person at the table to go on a 2-day trip with and say why",
    "tell the food the group orders most when gathering",
    "who in the group takes bad photos? that person takes a funny pose right now",
    "tell the catchphrase of the group or a member",
    "if the group was a movie, what would the movie name be?",
    "tell the time the whole group laughed \"insanely\" because of something tiny",
    "who is the person who screams loudest in the car/karaoke? that person sings 1 line",
    "tell a challenge the group overcame together",
    "if you had to give a gift to the person opposite, what would you give?",
    "tell the time you felt most protected by the group",
    "who is the \"most sober\" person after every drinking session? that person drinks/passes",
    "tell the group's dream trip plan",
    "who often takes on work/deadlines for the group? thank them with 1 sentence",
    "tell the time the group meeting turned into a long heart-to-heart",
    "who is usually the \"gatekeeper\" who pulls everyone home when it's too late?",
    "tell a small story that made you realize the group is very close",
    "who in the group is the organizer? that person shares tips for managing plans",
    "tell the time you and the group played board games/cards and the result",
    "who often makes people laugh when the group is tense? thank them",
    "tell the time the whole group \"encountered\" bad weather and overcame it",
    "who often spams memes in the group chat? that person sends/acts out 1 meme",
    "tell the time the group got excited and did something impulsive",
    "who is the person who replies slowest in the group chat? explain",
    "tell the time you misunderstood someone in the group and resolved it",
    "who often reminds everyone to drink water/eat? that person is exempt from 1 turn",
    "tell the time the group watched a movie together and the funniest reaction",
    "who in the group would survive if lost? everyone votes, the voted person tells why",
    "tell the time the group stayed up latest and what you were doing",
    "who is the person who often \"forgets wallet\"? that person shares the lesson learned",
    "tell an inside joke of the group (not too private)",
    "who laughs easiest? that person keeps a straight face for 10 seconds, if they laugh they drink",
    "tell the time the group \"switched roles\" (e.g.: serious became funny)",
    "if the whole group joined a game show, who would be MC? who would be the champion contestant?",
    "tell one thing you want to thank the whole group for",
    "who often checks in on time? that person gives a light challenge to the table",
    "tell the time the group took bad photos but still posted them",
    "who is the \"bank\" who often lends money? that person receives 1 thank you",
    "tell the time the group \"ate failure\" collectively (exam, work, project)",
    "who often suggests good places? that person shares tips for finding places",
    "tell the time the group tried new food and the reaction",
    "who is the person who \"sobers up\" and takes care of the group? that person gives 1 fun challenge",
    "tell the time the group cosplayed/acted (if any) or imagine what role you would play",
    "who likes taking candid photos? that person takes 1 quick photo for the table",
    "tell the time the group encountered traffic problems and how you handled it",
    "who often \"gets lost\" in the mall? that person tells the journey of finding the way",
    "tell the time the group played exercise games (plank, squat) and the result",
    "who always brings rescue items (bandages, candy, charger)? thank them",
    "tell the time the group \"switched seats\" in the car and what happened",
    "who collects the most memes? that person acts out their favorite meme",
    "tell the time the group went on the wrong day/wrong place but still had fun",
    "who often acts as MC introducing food? that person reviews an imaginary dish",
    "tell the time the group helped you study/review/work more effectively",
    "who is the person who \"avoids drama\" best? share the secret",
    "tell a sudden plan you want to invite the group to do right now",
    "who in the group often forgets to bring a jacket? that person shows their desperate way to stay warm",
    "tell the time the group organized a surprise birthday for someone",
    "who often takes photos of food? that person poses quickly in 5 seconds",
    "tell the time the group played word chain with member names and the result",
    "who is the person who is \"full of morning energy\"? share tips",
    "tell the time the group helped you calm down when stressed",
    "who is the person who \"explains game rules\" best? that person explains any rule in 15 seconds",
    "tell the time the group cleaned up/prepared for a big gathering",
    "who always brings backup battery? that person is chosen to skip 1 turn",
    "tell the time the group was \"unusually serious\" and why",
    "who is the person who sings wrong lyrics most? sing 1 line",
    "tell a small promise you want to make with the group",
    "who often \"makes slides\" for the group? that person shares tips for beautiful presentation",
    "tell the time the group played story continuation and what your part was",
    "who is the \"encyclopedia\" of the group? ask them a fun question",
    "tell the time the group almost missed the bus/train/plane",
    "who often suggests chill background music? that person plays/sings the melody for 5 seconds"
  ],
  "cong_so": [
    "tell an unforgettable overtime memory with colleagues",
    "who is always late to meetings? that person says a funny reason or drinks",
    "who sends the longest emails? that person summarizes in 10 seconds",
    "pitch this week's KPI/OKR in 10 seconds, otherwise drink",
    "tell the time you were unexpectedly praised by boss/colleague",
    "who often brings snacks/junk food for the team? thank them",
    "give a funny nickname to the team lead (they can veto, you drink)",
    "who replies \"received\" fastest? that person is exempt from 1 turn",
    "tell the time production/staging went wrong but was saved in time",
    "act as boss reminding about deadline in 10 seconds",
    "who has the best camera setup for meetings? that person chooses who drinks",
    "tell the time a meeting where the whole team laughed non-stop",
    "who spams memes in the public channel most? act out 1 meme",
    "tell the time the team burned through sprint but still shipped",
    "who likes offsite/team building most? say why",
    "tell the time daily standup went over 1 minute and why",
    "who often forgets to mute mic? that person drinks or apologizes",
    "tell the time you messaged the wrong channel (client/colleague)",
    "who survives end of quarter/Q4 best? share tips",
    "tell a trick to avoid meetings you've used (fun)",
    "who has the most tabs open? they must close 3 tabs or drink",
    "tell an unforgettable night deployment",
    "who often orders bubble tea/coffee for the team? invite one person to drink",
    "tell the time you saved a bug at minute 89 before demo",
    "who often \"busy but still joins\" meetings? share the secret",
    "tell a funny training/onboarding fail",
    "who keeps the most positive energy in the team? thank them",
    "tell the time you mixed up file/branch between staging and prod",
    "who likes retro meetings most? they suggest 1 improvement",
    "tell a tense but useful retro",
    "who is the \"IT department\" who fixes all devices? they are exempt from 1 turn",
    "tell the time the whole team discussed salary/bonus during lunch",
    "who often forgets to log work/timesheet? that person drinks",
    "tell the time the team got unexpected KPI/tasks but still handled it",
    "who brings rescue items (charger, bandages, medicine)? thank them",
    "tell the shared music/playlist of the team when working overtime",
    "who often requests emergency leave? tell the funniest recent reason",
    "tell an unforgettable onsite/business trip",
    "who is responsible for entertainment/MC of the team? they sing 1 line",
    "tell the time the team celebrated a successful release",
    "who often pings after work hours? that person states reasonable ping rules",
    "tell the time you got pinged at 12am and how you felt",
    "who uses the best slides? share 1 presentation tip",
    "tell the time demo failed and how you saved it",
    "who is the strictest QA? they choose 1 common bug",
    "tell the time code review was \"tense\" but you learned a lot",
    "who often drops useful document links? choose who drinks",
    "tell a funny onboarding of a new colleague",
    "who maintains clean desk culture? they share 1 tip",
    "tell the time the company moved offices and memories",
    "who often schedules meetings too late? that person drinks",
    "tell the time the team received collective reward/praise",
    "who often acts as MC for weekly meetings? give a fun introduction task",
    "tell the time brainstorm exploded with ideas most",
    "who talks least? ask them 1 question, they answer or drink",
    "tell the time you promised \"ship fast\" and learned a lesson",
    "who often corrects email grammar? they fix 1 funny sentence",
    "tell the time you shared a productivity tip that helped the team avoid disaster",
    "who often brings souvenirs from trips? thank them",
    "tell the time the team failed because of wrong assumption and the lesson",
    "who is the company's \"brand ambassador\"? they say 1 PR sentence",
    "tell an unforgettable candidate interview",
    "who often forgets to turn on camera? next time must turn on for 10 seconds or drink",
    "tell the time you accidentally called boss/colleague by name/funny pronoun",
    "who often sends GIF responses? send/act out 1 GIF",
    "tell the time you were muted but still talked enthusiastically",
    "who is afraid of presenting? say 1 sentence or drink",
    "tell the time the team saved each other from internal drama",
    "who remembers colleagues' birthdays best? they choose who drinks",
    "tell an unforgettable time the team participated in charity/CSR",
    "who often forgets to check inbox? they must check right now or drink",
    "tell an interesting internal workshop",
    "who asks the hardest questions in meetings? ask 1 light question",
    "tell the time the team had wrong KPI but fixed it in time",
    "who likes OKR most? state 1 benefit",
    "tell the funnest company vacation",
    "who often sends standard meeting notes? they summarize in 1 line",
    "tell a fun/unforgettable pair programming session",
    "who \"coordinates taxi/car\" for every plan? give 1 small challenge",
    "tell one thing you want to thank your colleagues for today"
  ]
}
